package synchronizers;

/*
🔧 Що таке "синхронізатори"?
    До синхронізаторів належать спеціальні класи з пакету java.util.concurrent,
    які координують роботу потоків — не через звичайну блокування (synchronized чи lock),
    а через вищорівневі механізми керування доступом і сигналізацією.

| Синхронізатор    | Опис                                                         |
| ---------------- | ------------------------------------------------------------ |
| `Semaphore`      | Обмежує кількість потоків, які можуть одночасно виконуватись |
| `CountDownLatch` | Чекає, доки інші потоки завершать певні дії                  |
| `CyclicBarrier`  | Синхронізує групу потоків на певному етапі                   |
| `Phaser`         | Гнучкіша альтернатива до `CyclicBarrier`                     |
| `Exchanger`      | Два потоки обмінюються об’єктами                             |
 */
public class Description {
}
